{"data":{"jobs":{"edges":[{"node":{"frontmatter":{"title":"Software Engineer, L4","company":"Google","location":"New York, NY","range":"August 2021 - Present","url":"https://blog.google/products/maps/"},"html":"<ul>\n<li>Improved Google Maps’ modeling of the world by researching real-world semantics and forming a unified model for 1st, 2nd, and 3rd party feeds.</li>\n<li>Responsible for data validation mechanism for Geo’s central datastore; augmented an engine running 1000s of checks to ensure billions of map entries are self-consistent and well-formed, on every edit.</li>\n<li>Refined Geo’s Knowledge Graph representation of the world via large-scale data &#x26; client migrations, easing the intake of new attributes and reducing data churn.</li>\n</ul>"}},{"node":{"frontmatter":{"title":"Undergraduate Research Assistant","company":"MIT Media Lab","location":"Cambridge, MA","range":"January 2019 - June 2021","url":"https://www.media.mit.edu/groups/viral-communications/overview/"},"html":"<ul>\n<li>Member of the Viral Media Lab, led by <a href=\"https://www.media.mit.edu/people/lip/overview/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Andrew Lippman</a>.</li>\n<li>Explored how the style (e.g. delivery, tone, color palette) with which media presents information affects our perception and understanding of the content</li>\n<li>Developed a distributed streaming system, <a href=\"https://www.media.mit.edu/projects/superglue/overview/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">SuperGlue</a>, which listened to ~20 live video feeds, applied a series of modules (e.g. generative network style transfer, speech-to-text, etc), and generated structured output for ML training / evaluation purposes.</li>\n</ul>"}},{"node":{"frontmatter":{"title":"Software Engineer Intern","company":"Google (Geo Assistant)","location":"Virtual","range":"June - August 2020","url":"https://www.android.com/auto/"},"html":"<ul>\n<li>Created a Google Assistant feature which informs users how many minutes away stops are while driving.</li>\n<li>Used an internal language-generation tool to provide conversational dialogue in over 18 locales.</li>\n<li>Collaborated with cross-functional teams to prevent Google Assistant's \"By the way\" feature from triggering at the wrong time.</li>\n</ul>"}},{"node":{"frontmatter":{"title":"Instructor","company":"MIT Weblab","location":"Cambridge, MA","range":"December 2019 - February 2021","url":"http://weblab.mit.edu"},"html":"<ul>\n<li>Taught ~250 students as part of MIT’s accelerated web-development class, covering web fundamentals (HTML/CSS) up to a modern web stack (ReactJS, NodeJS, Firebase, etc).</li>\n</ul>"}},{"node":{"frontmatter":{"title":"Software Engineer Intern","company":"Google (Search)","location":"Mountain View, CA","range":"June - August 2019","url":"https://blog.google/products/search/"},"html":"<ul>\n<li>Worked alongside the Google Search team on improving their <a href=\"https://en.wikipedia.org/wiki/User_intent\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">intent-based</a> understanding of websites. My focus was to find a hierarchical relationship between intents.</li>\n<li>Constructed a feature extraction pipeline which extracts hierarchical information about intents.</li>\n<li>Engineered a distributed Flume job which processed petabytes worth of websites.</li>\n</ul>"}},{"node":{"frontmatter":{"title":"Software Engineer Intern","company":"IBM","location":"Yorktown Heights, NY","range":"June - August 2018","url":"https://www.research.ibm.com/labs/watson/"},"html":"<ul>\n<li>Developed a command line tool to easily deploy applications in the IBM Cloud stack.</li>\n<li>Interfaced with Kubernetes, Istio, and IBM-specific services to create microservice &#x26; serverless deployments.</li>\n<li>Presented a working demo to the Cloud team where I deployed a scalable, serverless weather service with A/B testing and fault-tolerance using my tool.</li>\n</ul>"}}]}}}